> This article is converted from Wikipedia: [ \( \)](https://ko.wikipedia.org/wiki/_\(_\)).


**그렘린**(Gremlin)은 [아파치 소프트웨어 재단의](https://ko.wikipedia.org/wiki/아파치_소프트웨어_재단 "wikilink") 아파치 팅커팝(Apache TinkerPop)이 개발한 [그래프 순회](https://ko.wikipedia.org/wiki/그래프_순회 "wikilink") 언어이자 [가상 머신이다](https://ko.wikipedia.org/wiki/가상_머신 "wikilink"). 그렘린은 [OLTP](https://ko.wikipedia.org/wiki/온라인_트랜잭션_처리 "wikilink") 기반 그래프 데이터베이스, [OLAP](https://ko.wikipedia.org/wiki/온라인_분석_처리 "wikilink") 기반 그래프 프로세서와 함께 동작한다.

그렘린의 [오토마타](https://ko.wikipedia.org/wiki/오토마타_이론 "wikilink") 및 [함수형 언어](https://ko.wikipedia.org/wiki/함수형_프로그래밍 "wikilink") 파운데이션은 그렘린이 자연스럽게 [명령형](https://ko.wikipedia.org/wiki/명령형_프로그래밍 "wikilink"), [선언형](https://ko.wikipedia.org/wiki/선언현_프로그래밍 "wikilink") 쿼리, 호스트 언어 아그노스티시즘, 사용자 지정 [도메인 특화 언어](../Page/도메인_특화_언어.md "wikilink"), 확장 가능한 컴파일러/옵티마이저, 싱글 및 멀티 실행 모델, hybrid depth- 및 breadth-first 평가, [튜링 완전을](https://ko.wikipedia.org/wiki/튜링_완전 "wikilink") 지원할 수 있게 한다.\[1\]

## 역사

  - 2009-10-30 프로젝트 탄생, 팅커팝(TinkerPop)의 이름
  - 2009-12-25 v0.1 최초 릴리스
  - 2011-05-21 v1.0 출시
  - 2012-05-24 v2.0 출시
  - 2015-01-16 팅커팝이 아파치 인큐베이터 프로젝트가 됨
  - 2015-07-09 v3.0.0-incubating 출시
  - 2016-05-23 아파치 팅커팝이 최상위 프로젝트로 됨
  - 2016-07-18 v3.1.3 및 v3.2.1이 아파치 팅커팝으로 첫 출시
  - 2017-12-17 v3.3.1 출시

## 벤더 연동

그렘림은 [아파치2-라이선스의](https://ko.wikipedia.org/wiki/아파치_라이선스 "wikilink") 그래프 순회 언어이며 그래프 시스템 벤더들에 의해 사용할 수 있다. 일반적으로 두 종류의 그래프 시스템 벤더가 있다: OLTP [그래프 데이터베이스](../Page/그래프_데이터베이스.md "wikilink") 및 OLAP 그래프 프로세서. 아래의 표는 그렘린을 지원하는 그래프 벤더를 요약한 것이다.

| 벤더                                                                                                                           | 그래프 시스템                                                             |
| ---------------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------- |
| [Neo4j](../Page/Neo4j.md "wikilink")                                                                                         | 그래프 데이터베이스                                                          |
| [OrientDB](https://ko.wikipedia.org/wiki/OrientDB "wikilink")                                                                | 그래프 데이터베이스                                                          |
| [DataStax](https://ko.wikipedia.org/wiki/DataStax "wikilink") Enterprise (5.0+)                                              | 그래프 데이터베이스                                                          |
| [Hadoop](https://ko.wikipedia.org/wiki/아파치_하둡 "wikilink") ([Giraph](https://ko.wikipedia.org/wiki/Apache_Giraph "wikilink")) | 그래프 프로세서                                                            |
| [Hadoop](https://ko.wikipedia.org/wiki/아파치_하둡 "wikilink") ([Spark](../Page/아파치_스파크.md "wikilink"))                           | 그래프 프로세서                                                            |
| [InfiniteGraph](https://ko.wikipedia.org/wiki/InfiniteGraph "wikilink")                                                      | 그래프 데이터베이스                                                          |
| [JanusGraph](https://ko.wikipedia.org/wiki/JanusGraph "wikilink")                                                            | 그래프 데이터베이스                                                          |
| [Cosmos DB](https://ko.wikipedia.org/wiki/Cosmos_DB "wikilink")                                                              | 그래프 데이터베이스                                                          |
| [Amazon Neptune](https://ko.wikipedia.org/wiki/Amazon_Neptune "wikilink")                                                    | 그래프 데이터베이스                                                          |
| [Ontotext](https://ko.wikipedia.org/wiki/Ontotext "wikilink") 그래프DB                                                          | [Triplestore](https://ko.wikipedia.org/wiki/Triplestore "wikilink") |

## 순회의 예

그렘린-그루비 환경에서 다음의 그렘린 쿼리 및 응답의 예는 [MovieLens](https://web.archive.org/web/20180207123351/https://grouplens.org/datasets/movielens/) 데이터셋의 그래프 표현에 상대적이다.\[2\] 데이터셋에는 영화를 평가하는 사용자들이 포함되어 있다. 사용자는 각자 하나의 직업이 있으며 각 영화는 그와 연계된 하나 이상의 분류가 있다. MovieLens 그래프 스키마는 아래와 같다.

``` cypher
user--rated[stars:0-5]-->movie
user--occupation-->occupation
movie--category-->category
```

### 단순 순회

``` groovy
gremlin> g.V().label().groupCount()
==>[occupation:21, movie:3883, category:18, user:6040]
```

``` groovy
gremlin> g.V().hasLabel('movie').values('year').min()
==>1919
```

``` groovy
gremlin> g.V().has('movie','name','Die Hard').inE('rated').values('stars').mean()
==>4.121848739495798
```

## 각주

## 외부 링크

  - [Apache TinkerPop Homepage](https://web.archive.org/web/20170710070127/http://www.tinkerpop.com/)
  - [GremlinDocs.com (TinkerPop2)](https://web.archive.org/web/20180208095222/http://gremlindocs.com/)
  - [sql2gremlin.com (TinkerPop2)](https://web.archive.org/web/20180212070550/http://sql2gremlin.com/)
  - Rodriguez, M.A., "[The Gremlin Graph Traversal Machine and Language](https://arxiv.org/abs/1508.03843)," Proceedings of the ACM Database Programming Languages Conference, October, 2015.

[분류:클러스터 컴퓨팅](https://ko.wikipedia.org/wiki/분류:클러스터_컴퓨팅 "wikilink") [분류:하둡](https://ko.wikipedia.org/wiki/분류:하둡 "wikilink") [분류:아파치 소프트웨어 재단](https://ko.wikipedia.org/wiki/분류:아파치_소프트웨어_재단 "wikilink") [분류:자바 플랫폼](https://ko.wikipedia.org/wiki/분류:자바_플랫폼 "wikilink") [분류:스칼라로 작성된 자유 소프트웨어](https://ko.wikipedia.org/wiki/분류:스칼라로_작성된_자유_소프트웨어 "wikilink") [분류:선언형 프로그래밍 언어](https://ko.wikipedia.org/wiki/분류:선언형_프로그래밍_언어 "wikilink") [분류:아파치 라이선스 소프트웨어](https://ko.wikipedia.org/wiki/분류:아파치_라이선스_소프트웨어 "wikilink")

1.
2.